[
    {
        "title": "Bike Traffic in Cambridge Interactive Visualization",
        "year": 2025,
        "image": "imgs/dsc106lab7.jpg",
        "description": "An interactive map which highlights the bikepaths of Cambridge, Massachussets. The map also shows the bike traffic in the area, with the thickness of the lines representing the amount of bike traffic in that area.",
        "url": "https://nathansso.github.io/datacycling/"
    },
    {
        "title": "How Airbnb Tourism was impacted by the San Diego Sunshine",
        "year": 2025,
        "image": "imgs/DSC Project 01.png",
        "description": "A static graph which explores Airbnb bookings and revenue throughout the year in San Diego, California. The graph shows how the number of bookings and revenue changes throughout the year, with the highest peaks in the summer months.",
        "url": null
    },
    {
        "title": "The Impact of Estrus on Female Rats Throughout the Day",
        "year": 2025,
        "image": "imgs/DSC Project 02.png",
        "description": "This graph is a static visualization of the body temperature across male and female mice. Used to explore differences in the daily cylce of body temperature while highlighting the impact of female estrus.",
        "url": null
    },
    {
        "title": "AllRecipes Rating Predictive Classification Model",
        "year": 2024,
        "image": "imgs/dsc80_final_proj.jpg",
        "description": "This machine learning model predicts the ratings of recipes on AllRecipes.com based on features of the recipe. We created a multiclass-classifier using a RandomForest.",
        "url": "https://aconsiglio03.github.io/Recipe-Review-Analysis/"
    },
    {
        "title": "Study of the Presence of Educational Institutions and Income Throughout California",
        "year": 2024,
        "image": "imgs/math189finalproj.jpg",
        "description": "An exploratory data analysis of the presence of educational institutions and income throughout California. The project uses a heatmap to show the distribution of educational institutions and income throughout the state of California.",
        "url": null
    },
    {
        "title": "Image Processor",
        "year": 2024,
        "image": "imgs/test_image_32x32_negate.png",
        "description": "Built an image processor that can read in an image, apply a filter to it, and then output the processed image. The image processor can apply filters such as negate, grayscale, and edge detection. This project was built using Python.",
        "url": null
    },
    {
        "title": "Asteroid Landfall Simulation",
        "year": 2023,
        "image": "imgs/dsc10finalproj.jpg",
        "description": "Written using pandas in the Jupyter Notebook environment, this project simulates the landfall of asteroids using historical datasets, probabilistic modeling, and bootstrapping.",
        "url": null
    },
    {
        "title": "Interactive Visualization of Mice Body Temperature Across Gender",
        "year": 2025,
        "image": "imgs/dsc106proj3.jpg",
        "description": "An interactive visualization of the body temperature across the gender of mice. The visualization allows users to explore the differences in body temperature while allowing filtering and the altering of scope. Features a tooltip which highlights Mouse ID allowing us to examine indvidual mice along with their estrus cycle( should they be female).",
        "url": "https://sebastianferragut.github.io/miced3/"
    },
    {
        "title": "Aliquid rem magni veniam.",
        "year": 2023,
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Quae minima eius aliquam quam distinctio sit a fuga fugit dolorem est cupiditate delectus recusandae neque voluptatem, autem assumenda blanditiis, nam in ducimus minus eos debitis nesciunt et architecto? Assumenda?",
        "url": null
    },
    {
        "title": "Nisi officia perspiciatis mollitia.",
        "year": 2022,
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Mollitia quae perferendis accusantium repudiandae aliquid esse magnam harum nihil soluta est, inventore id explicabo itaque hic suscipit reprehenderit placeat, totam officia, vero quaerat consectetur a. Accusantium consectetur doloribus quod?",
        "url": null
    },
    {
        "title": "Eveniet minus in magni.",
        "year": 2023,
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Autem impedit dignissimos quidem voluptates ea aliquam iusto dolores nisi, tenetur fuga voluptas, assumenda suscipit praesentium, voluptatum maiores! Pariatur repudiandae doloribus maxime nihil ad perspiciatis facilis accusamus beatae sed in.",
        "url": null
    },
    {
        "title": "Rerum, asperiores fugiat. Corrupti?",
        "year": 2025,
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Libero, qui ipsa praesentium, recusandae ut nesciunt repellendus quaerat reiciendis adipisci corporis dolores molestiae, culpa maxime voluptates dolore. Vero, nemo omnis reprehenderit commodi rerum totam ipsa magni asperiores molestiae neque.",
        "url": null
    }
]